#Създайте речник, съдържащ информация за книга (заглавие, автор, година на издаване). Изведете информацията за автора  и годината. Добавете ключ "жанр" със съответна стойност.

# Създаване на речник с информация за книга
dict_book = {
    "Заглавие": "Венету",
    "Автор": "Карл Май",
    "Година": "1965"
}

# Извеждаме информацията за книгата
print(f'Име на книгата: {dict_book["Заглавие"]}')
print(f'Автор на книгата: {dict_book["Автор"]}')
print(f'Година на издаване на книгата: {dict_book["Година"]}')

# Показваме първоначалния речник
print(f"Първоначален речник: {dict_book}")

# Добавяме нов ключ и стойност (жанр)
dict_book['Жанр'] = "Приключенски"

# Показваме речника след добавяне на новия ключ
print(f"Речникът след добавяне на ключ 'Жанр': {dict_book}")
