#Дадени са два списъка list1 = [1, 2, 3, 4, 5] и list2 = [3, 5, 6, 7]. Преобразувайте ги в множества и намерете
# тяхното обединение, сечение и разлика (list1 - list2).

# Дадени са два списъка
list1 = [1, 2, 3, 4, 5]
list2 = [3, 5, 6, 7]

# Преобразуваме списъците в множества
set1 = set(list1)
set2 = set(list2)

# Извеждаме множества
print(f"Първо множество: {set1}")
print(f"Второ множество: {set2}")
print()

# Обединение на множества (елементи, които са в едното или в другото множество)
print(f"Обединение: {set1 | set2}")

# Сечение на множества (общи елементи между двете множества)
print(f"Сечение: {set1 & set2}")

# Разлика на множества (елементи в set1, които не са в set2)
print(f"Разлика между set1 и set2: {set1 - set2}")

# Разлика на множества (елементи в set2, които не са в set1)
print(f"Разлика между set2 и set1: {set2 - set1}")

# Симетрична разлика (елементи, които са само в едното от множествата)
print(f"Симетрична разлика: {set1 ^ set2}")
