#Създайте списък с числа от 1 до 10. Изведете първите три елемента, последните два и всички елементи с четни индекси.

# Създаване на списък с числа от 1 до 10
list_number = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

# Извеждаме първите три елемента
print(f"Първите три елемента са: {list_number[:3]}")

# Извеждаме последните два елемента с помощта на отрицателни индекси
print(f"Последните два елемента са: {list_number[-2:]}")

# Извеждаме елементите с четни индекси (всеки втори елемент започвайки от 0)
print(f"Само елементи с четни индекси са: {list_number[::2]}")
