#Създайте програма, която пита потребителя да въведе няколко имена и ги записва във файл, като всяко име е на нов ред.


# Печата съобщение, което обяснява на потребителя какво трябва да въведе.
# В този случай, казва, че ако иска да излезе, трябва да въведе празно име.
print("За изход въведете празно име")

# Отваряме файл за запис в режим "w" (write) с кодировка "utf-8".
# Ако файлът не съществува, той ще бъде създаден. Ако съществува, ще бъде презаписан.
with(open("file_of_name.txt", "w", encoding="utf-8")) as file:
	# Стартиране на безкраен цикъл, който ще продължава, докато потребителят не въведе празно име.
	while True:
		# Изискваме от потребителя да въведе име.
		n = input("Въедете име: ")

		# Ако потребителят въведе празно име, излизаме от цикъла.
		# Това означава, че потребителят не иска да добавя повече имена.
		if n == "":
			break

		# Записваме името във файла. Добавяме нов ред след всяко име, за да са на отделни редове.
		file.write(n + "\n")

# След като цикълът приключи (потребителят е въведе празно име), показваме съобщение,
# че файлът е записан успешно. Това дава обратна връзка на потребителя, че процесът е завършен.
print("*" * 30)
print("Файлът е записан")

