#Напишете програма, която пита потребителя за радиус на кръг. Пресметнете неговия периметър (2πr) и лице (πr²) и ги
# изведете форматирано до два знака след десетичната запетая. (Можете да използвате π≈3.14159).

PI = 3.14159
r = float(input("Въведете радиуса на кръга: "))

# Изчисляваме периметъра и лицето на кръга
p = 2 * PI * r
s = PI * r ** 2

# Извеждаме резултатите форматирани до два знака след десетичната запетая
print(f"Периметърът на кръга е: {p:.2f}")
print(f"Лицето на кръга е: {s:.2f}")
