#Напишете програма, която пита потребителя дали обича програмиране (въведете "да" или "не"). Изведете съобщение,
# съответстващо на неговия отговор.

# Питаме потребителя дали обича програмиране
answer = input("Обичате ли програмиране? (да/не) -> ").lower()

# Проверяваме отговора и изкарваме съответното съобщение
if answer == "да":
    print("Страхотно! Програмирането е забавно!")
elif answer == "не":
    print("Жалко! Програмирането е наистина интересно!")
else:
    print("Моля, отговорете с 'да' или 'не'.")
