# 21.	Имате DataFrame с индекс, който искате да превърнете обратно в обикновена колона. Напишете код, който нулира индекса, използвайки .reset_index().

import pandas as pd

# Примерен DataFrame с индекс 'ID'
df = pd.DataFrame({
    'Име': ['Анна', 'Боби', 'Чарли'],
    'Град': ['София', 'Пловдив', 'Варна']
}, index=[101, 102, 103])

print(f"Оригиналния DataFrame\n {df}")
# Нулираме индекса и го превръщаме в обикновена колона
df = df.reset_index()

print(f"\nDataFrame след нулиране на индекса:\n{df}")
