#Напишете програма, която извежда следния модел от звездички:
# *
# * *
# * * *
# * * * *
# * * * * *

# 1. Решение с един цикъл:
# Всеки път умножаваме звездичката "*" по броя на реда i, за да получим необходимия брой звездички
for i in range(1, 6):  # Извършваме 5 итерации
    print("*" * i)  # Печатаме толкова звездички, колкото е текущото i

print()  # Добавяме празен ред между двата модела

# 2. Решение с вложен цикъл:
# Външният цикъл отговаря за броя редове, а вътрешният за броя на звездичките в даден ред
for i in range(1, 6):  # 5 реда
    for j in range(i):  # За всеки ред отпечатваме i звездички
        print("*", end="")  # Печатаме една звездичка на същия ред, без нов ред
    print()  # Преминаваме на нов ред след вътрешния цикъл
