#Напишете програма, която чете числа от потребителя, докато не бъде въведено числото 0. След това изведете сумата на всички въведени числа (без 0). Използвайте while цикъл и break.

# Инициализираме променлива за резултата
result = 0

# Стартираме безкраен цикъл, който ще прекъснем с break
while True:
	# Въвеждаме число от потребителя
	choyse = float(input("Въведете число (за прекратяване въведете 0): "))

	# Ако числото е 0, прекратяваме цикъла
	if choyse == 0:
		break
	else:
		# Добавяме числото към резултата
		result += choyse

# Извеждаме финалната сума
print(f"Резултатът от сумирането на всички числа е: {result:.2f}")
