#Напишете програма, която проверява дали дадена година е високосна. (Високосна е годината, която се дели на 4, но не се дели на 100, освен ако се дели и на 400).

# Приемане на вход от потребителя – годината
year = int(input("Въведете година: "))

# Проверка дали годината е високосна:
# Условие:
# - Годината е високосна, ако се дели на 4 И не се дели на 100,
#   ИЛИ ако се дели на 400 (това е изключението за вековни години)
if (year % 4 == 0 and year % 100 != 0) or (year % 400 == 0):
    print("Годината е високосна")
else:
    print("Годината не е високосна")

