#Напишете програма, която приема число като вход и извежда неговата таблица за умножение до 10.

# Приемаме цяло число от потребителя
n = int(input("Въведете число: "))


# Извеждаме таблицата за умножение на това число от 1 до 10
print(f"Таблица за умножение на {n}:")
for i in range(1, 11):
    print(f"{n} x {i:2} = {n * i}")

# Подредена в колони таблица за умножение:
n = int(input("\nВъведете число от 1 до 10 за да ги подредим по колони: "))

# Заглавен ред (таблиците)
print("\n", end="  ")
for i in range(1, n + 1):
    print(f"   Таблица по {i:2}   ", end=" ")
print("\n" + "-" * (n * 20))

# Всеки ред е за съответния множител от 1 до 10
for j in range(1, 11):
    for i in range(1, n + 1):
        print(f"{i:2} x {j:2} = {i * j:3}", end="       ")
    print()  # нов ред за следващия множител
