#Използвайте функцията `filter()` и lambda функция, за да филтрирате само нечетните числа от даден списък.

import random  # Импортиране на модула random, който генерира случайни числа

# Генерираме списък от 10 случайни числа между 1 и 100
list_number = [random.randint(1, 100) for _ in range(10)]

# Извеждаме списъка с произволни числа
print(list_number)

# Филтрираме нечетните числа от списъка с помощта на lambda функция
# lambda функцията връща True за нечетни числа (не се делят на 2)
list_odd_number = list(filter(lambda x: not (x % 2 == 0), list_number))

# Извеждаме списъка с нечетни числа
print(list_odd_number)
