#Напишете функция, която приема число като аргумент и проверява дали е просто.

def is_prime(n: int) -> bool:
    if n < 2:
        return False  # Числата по-малки от 2 не са прости
    for i in range(2, int(n**0.5) + 1):  # Проверяваме до квадратния корен от n
        if n % i == 0:  # Ако има делител, числото не е просто
            return False
    return True  # Ако няма делители, числото е просто

# Въвеждаме число от потребителя
my_number = int(input("Въведете произволно цяло число: "))

# Проверяваме дали е просто
print("Числото е просто: ", is_prime(my_number))


