#Напишете функция, която приема низ като аргумент и връща нов низ, в който всички главни букви са заменени с малки и обратното.

#1. Класически метод:
def invert_case_classic(text: str) -> str:
    new_text = ''  # Създаваме нов низ, в който ще добавяме променените символи
    for char in text:
        if char.islower():  # Ако символът е малка буква
            new_text += char.upper()  # Променяме я на голяма
        elif char.isupper():  # Ако символът е голяма буква
            new_text += char.lower()  # Променяме я на малка
        else:
            new_text += char  # Ако не е буква, я оставяме без промяна
    return new_text

# Пример за тестване на класическия метод:
print("Използване на класически метод за думата СтоЯн : ", invert_case_classic("СтоЯн"))

print("\n")

#2. Използване на функцията swapcase() вградена в типа string:
def invert_case_swapcase(text):
    """Функция, която приема низ като аргумент и връща нов низ, в който всички главни букви са заменени с малки и обратното"""
    return text.swapcase()  # Използваме вградената функция swapcase()

# Пример за тестване на метода с swapcase():
print("Използване на функцията swapcase() за думата СтояН : ", invert_case_swapcase("СтояН"))

