#4.	Напишете програма, която съдържа списък с числа. Опитайте се да достъпите елемент от списъка по индекс, въведен от потребителя. Използвайте try-except IndexError блок, за да обработите грешката, ако индексът е извън границите на списъка.

# Списък с няколко цели числа
my_list = [1, 5, 7, 8, 3, 10]

# Функция, която се опитва да достъпи елемент от списъка по подаден индекс
def select_index_list(n: int):
    try:
        print(f"Елементът на позиция {n} е: {my_list[n]}")  # Опит за достъп до елемент
    except IndexError:
        # Ако индексът е извън обхвата на списъка, се улавя грешката
        print(f"ГРЕШКА: Индекс с номер {n} е извън обхвата на списъка!")

# Показваме съдържанието на списъка
print("Списък:", my_list)

# Четем индекс от потребителя
try:
    choice_index = int(input("Въведете търсения индекс: "))
    select_index_list(choice_index)
except ValueError:
    # Улавяме случай, при който потребителят не е въвел валидно цяло число
    print("ГРЕШКА: Моля, въведете валидно цяло число!")