# 1.	Създаване на Series: Създайте Pandas Series, съдържащ месеците от годината (като низове) като стойности, а като индекс използвайте съкратените им имена (Jan, Feb, Mar, ... Dec).

import pandas as pd  # Импортиране на библиотеката pandas

# Дефиниране на съкратените имена на месеците (индекси на Series обекта)
month_index = ('Jan', 'Feb', 'Mar', 'Apr', 'May', 'Jun',
               'Jul', 'Aug', 'Sep', 'Oct', 'Nov', 'Dec')

# Създаване на списък със стойности – пълните имена на месеците на български
month_names_bg = ['Януари', 'Февруари', 'Март', 'Април', 'Май', 'Юни',
                  'Юли', 'Август', 'Септември', 'Октомври', 'Ноември', 'Декември']

# Създаване на Series обект, в който индексът са съкратените имена, а стойностите са пълните имена на месеците
month_series = pd.Series(data=month_names_bg, index=month_index)

# Отпечатване на резултата
print("Списък с месеците (Series):\n")
print(month_series)



