# 16.	За студентите с оценка по-висока от 9.0, задайте стойност 'Отличен' в нова колона 'Статус'.

import pandas as pd

data = {'Име': ['Алиса', 'Боб', 'Чарли', 'Дейвид', 'Ева'],
        'Възраст': [25, 30, 22, 35, 28],
        'Град': ['София', 'Пловдив', 'София', 'Варна', 'Бургас'],
        'Оценка': [8.5, 9.2, 7.8, 9.2, 8.9]}
df_students = pd.DataFrame(data)

print("Оригинален DataFrame:\n", df_students, "\n")

df_students['Статус'] = ''  # Инициализиране на празна колона
df_students.loc[df_students['Оценка'] > 9.0, 'Статус'] = 'Отличен'

print(df_students)