# 15.	Увеличете възрастта на всички студенти с 1 година.

import pandas as pd

data = {'Име': ['Алиса', 'Боб', 'Чарли', 'Дейвид', 'Ева'],
        'Възраст': [25, 30, 22, 35, 28],
        'Град': ['София', 'Пловдив', 'София', 'Варна', 'Бургас'],
        'Оценка': [8.5, 9.2, 7.8, 9.2, 8.9]}
df_students = pd.DataFrame(data)

print("Оригинален DataFrame:\n", df_students, "\n")

# Увеличаваме възрастта с 1 година
df_students['Възраст'] += 1

print("След увеличаване на възрастта с 1:\n", df_students)
