# 12.	Изведете всички редове, където поне една от числовите колони ('Възраст', 'Оценка') е по-голяма от 30 или 9.0 съответно.
import pandas as pd

data = {'Име': ['Алиса', 'Боб', 'Чарли', 'Дейвид', 'Ева'],
        'Възраст': [25, 30, 22, 35, 28],
        'Град': ['София', 'Пловдив', 'София', 'Варна', 'Бургас'],
        'Оценка': [8.5, 9.2, 7.8, 9.2, 8.9]}
df_students = pd.DataFrame(data)

set_town = ('Пловдив', 'Бургас')
result = df_students[(df_students['Възраст']>30) | (df_students['Оценка'] > 9)]

print(result)