#Напишете код, който създава NumPy array с булеви стойности въз основа на сравнение на друг числов масив с дадена стойност (например, проверете кои елементи на масива [5, 10, 15, 20] са по-големи от 12).

import numpy as np

# Създаване на масив
a = np.array([5, 10, 15, 20])

# Създаване на булев масив, който показва кои елементи на 'a' са по-големи от 12
boolean_array = a > 12

# Извеждане на резултатите
print(f"Булев масив на елементи от {a} които са по-големи от 12: {boolean_array}")

# Булев масив на елементи от [ 5 10 15 20] които са по-големи от 12: [False False  True  True]



