#Създайте два NumPy array-я с различни форми, които могат да бъдат broadcast-нати заедно. Извършете аритметична операция между тях и изведете резултата и формата на резултатния масив.

import numpy as np

# Създаване на два масива
a = np.array([[5, 4, 2], [12, 6, 3], [56, 100, 11]])
b = np.array([[5, 2, 3]])

# Извършване на аритметична операция
c = a + b

# Извеждане на резултата
print(f"{a} + {b} =\n\n{c}")


# [[  5   4   2]
#  [ 12   6   3]
#  [ 56 100  11]] + [[5 2 3]] =
#
# [[ 10   6   5]
#  [ 17   8   6]
#  [ 61 102  14]]

