#Създайте NumPy array от списъка [10, 20, 30, 40, 50]. Изведете неговата форма (shape), тип на данните (dtype) и брой на измеренията (ndim).

# Импортиране на модула numpy, който предоставя множество функции за работа с многомерни масиви
import numpy as np

# Създаване на списък от числа
my_list = [10, 20, 30, 40, 50]

# Преобразуваме списъка в NumPy масив
list_array = np.array(my_list)

# Извеждаме формата (shape) на масива - т.е. размера му по всяко измерение
print(f"Формата на {list_array} e {list_array.shape}")

# Извеждаме типа на данните (dtype) на масива - например, може да бъде int, float и т.н.
print(f"Типът на данните на {list_array} e {list_array.dtype}")

# Извеждаме броя на измеренията (ndim) на масива - т.е. колко оси има масивът
print(f"Броят на измеренията на {list_array} e {list_array.ndim}")
