# 4.	Уникални стойности и честоти:
# o	Изберете една или няколко категорийни колони от вашия DataFrame.
# o	Използвайте .unique() за да видите всички уникални стойности в тези колони.
# o	Използвайте .nunique() за да преброите броя на уникалните стойности.
# o	Използвайте .value_counts() за да видите честотата на всяка уникална стойност. Има ли неочаквани или неконсистентни записи?

from DataFrame_Example import df

print(df["name"].unique())
print(df["name"].nunique())
print(df["name"].value_counts())

